---
kind: property
id: P:Autodesk.Revit.DB.UnitTypeId.SquareMillimetersPerMeter
source: html/936fc3df-36a7-9eb7-e2d8-d4324cf0e54a.htm
---
# Autodesk.Revit.DB.UnitTypeId.SquareMillimetersPerMeter Property

Square millimeters per meter.

## Syntax (C#)
```csharp
public static ForgeTypeId SquareMillimetersPerMeter { get; }
```